In [1]:
import pandas as pd

In [39]:
dados1 = {'Departamento':['unisp jipa', 'unisp nova mamore', 'unisp vilhena'], 'Bem': ['cadeira', 'cadeira', 'mesa'], 'Tombamento':[1234, 4324, 2365]}

In [43]:
df1 = pd.DataFrame(dados1)

In [15]:
bem = df1['Bem']

In [21]:
bem.value_counts() #contar todos os valores diferentes

computador    1
mesa          1
Cadeira       1
Name: Bem, dtype: int64

In [28]:
df1

        Departamento         Bem  Tombamento
0         unisp jipa     Cadeira        1234
1  unisp nova mamore  computador        4324
2      unisp vilhena        mesa        2365

In [49]:
bem = df1[['Bem']]
bem = df1.drop_duplicates(subset = ['Bem'])
bem = df1.reset_index()

In [51]:
bemdrop = bem.drop(columns = ['index'])

In [53]:
bemcoluna= bem.T.reset_index()

In [55]:
bemcoluna

          index           0                  1              2
0         index           0                  1              2
1  Departamento  unisp jipa  unisp nova mamore  unisp vilhena
2           Bem     cadeira            cadeira           mesa
3    Tombamento        1234               4324           2365

In [58]:
df1.groupby('Bem')['Departamento'].apply(lambda df: df.reset_index(drop=True)).unstack(0)

Bem            cadeira           mesa
0           unisp jipa  unisp vilhena
1    unisp nova mamore            NaN